# Задача 4: 
# Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, 
# что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

S = int(input('Введите количество журавликов: '))
# x + x + (x + x)*2 = S, (6x = S)- уравнение для этой задачи.
x = S // 6  # количество журавликов, сделанных каждым из Пети и Сережи
y = 2 * (x + x)   # количество журавликов, сделанных Катей

print('Петя:', x)
print('Катя:', y)
print('Сережа:', x)








